tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "surge-downloader/tap"
tap "tinypkg/tap"
brew "agg"
brew "asciinema"
brew "bat"
brew "chezmoi"
brew "cmatrix"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg-full", link: true
brew "figlet"
brew "fx"
brew "fzf"
brew "genact"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "gitlogue"
brew "gittype"
brew "htop"
brew "imagemagick-full", link: true
brew "jc"
brew "jq"
brew "lazygit"
brew "lazyssh"
brew "lnav"
brew "lolcat"
brew "mcat"
brew "mole"
brew "neovim"
brew "node"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "starship"
brew "tree-sitter-cli"
brew "uv"
brew "wget"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "tinypkg/tap/rime-wanxiang-updater"
cask "nikitabobko/tap/aerospace"
cask "bruno"
cask "font-jetbrains-mono-nerd-font"
cask "font-lxgw-wenkai"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "karabiner-elements"
cask "lunar"
cask "neovide-app"
cask "obsidian"
cask "qlmarkdown"
cask "surge-downloader/tap/surge"
cask "syntax-highlight"
uv "aider-chat", with: ["pip"]
